In [1]:
import pandas as pd

In [28]:
df_for_replace = pd.read_csv('for_replace_tran.csv')
df_base_tran = pd.read_csv('base_tran.csv')

In [32]:
df_pe_zero = df_for_replace[df_for_replace['PE']==0]

In [33]:
df_pe_zero

   tri_num  PE
1  AA11020   0
2  AA11030   0
3  AA11040   0
4  AA11050   0
6  AA11070   0
9  AA11100   0

In [34]:
pe_zero_list

['AA11020', 'AA11030', 'AA11040', 'AA11050', 'AA11070', 'AA11100']

In [29]:
df_base_tran

   tri_num     PE
0  AA11010  10000
1  AA11020  12000
2  AA11030  13000
3  AA11040      0
4  AA11050      0
5  AA11060  90000
6  AA11070      0
7  AA11080  75000
8  AA11090  74000
9  AA11100  40100

In [39]:
pd.merge(df_base_tran, df_pe_zero, on='tri_num', how='left')

   tri_num   PE_x  PE_y
0  AA11010  10000   NaN
1  AA11020  12000   0.0
2  AA11030  13000   0.0
3  AA11040      0   0.0
4  AA11050      0   0.0
5  AA11060  90000   NaN
6  AA11070      0   0.0
7  AA11080  75000   NaN
8  AA11090  74000   NaN
9  AA11100  40100   0.0